# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Work\PSoC_Projects\CY8CKIT-059\CY8CKIT-059_Bootloader.cydsn\CY8CKIT-059_Bootloader.cyprj
# Date: Mon, 04 Oct 2021 09:39:35 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 96001 192001} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 53 105} -nominal_period 2166.6666666666665 [list [get_pins {ClockBlock/dclk_glb_1}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for D:\Work\PSoC_Projects\CY8CKIT-059\CY8CKIT-059_Bootloader.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Work\PSoC_Projects\CY8CKIT-059\CY8CKIT-059_Bootloader.cydsn\CY8CKIT-059_Bootloader.cyprj
# Date: Mon, 04 Oct 2021 09:39:31 GMT
